
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 
    ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    
    ДиалогВыбораФайла.Каталог = Объект.ИмяФайла;
    ДиалогВыбораФайла.Заголовок = "Выберите каталог";
    
    ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ФайлНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)));
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	
	
	Если НЕ (ВыбранныеФайлы <> Неопределено) Тогда
		Возврат;
	КонецЕсли;    
	
	Объект.ИмяФайла= ДиалогВыбораФайла.ПолноеИмяФайла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	Если ПустаяСтрока(Объект.ИмяФайла) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не задано имя файла!";
		Сообщение.Поле = "Объект.ИмяФайла";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Инструмент) Тогда
	  Сообщение = Новый СообщениеПользователю;
	  Сообщение.Текст = "Не выбран инструмент!";
	  Сообщение.Поле = "Объект.Инструмент";
	  Сообщение.УстановитьДанные(ЭтотОбъект);
	  Сообщение.Сообщить(); 
	  Возврат;
	КонецЕсли;
	
	Если  Не ЗначениеЗаполнено(Объект.Таймфрейм)Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен таймфрейм!";
		Сообщение.Поле = "Объект.Таймфрейм";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	   Возврат;
	КонецЕсли;
	
	
	Если  Не ПрочитатьФайлНаСервере() Тогда
		
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл!";
		//Сообщение.Поле = "";
		//Сообщение.УстановитьДанные();
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция  ПрочитатьФайлНаСервере()
	Результат = Ложь;
	Объект.Котировки.Очистить();
	
	Чтение = Новый ЧтениеТекста();                                   
	Попытка
		
		Чтение.Открыть(Объект.ИмяФайла,КодировкаТекста.UTF8);
		
		Строка = Чтение.ПрочитатьСтроку();
		Строка = Чтение.ПрочитатьСтроку();
		
		
		Пока  Не Строка = Неопределено Цикл
			
			
			
			МассивЗначений = СтрРазделить(Строка,Символы.Таб,Ложь);
			
			НоваяСтрока = Объект.Котировки.Добавить();
			НоваяСтрока.Таймфрейм = Объект.Таймфрейм;
			НоваяСтрока.Инструмент = Объект.Инструмент;
			Если НЕ СтрНайти(МассивЗначений[1],":") Тогда
				
				НоваяСтрока.Период = Дата(ПеревернутьДату(МассивЗначений[0])+ " 00:00:00");
				НоваяСтрока.Open = МассивЗначений[1]; 
				НоваяСтрока.High = МассивЗначений[2];
				НоваяСтрока.Low = МассивЗначений[3];  
				НоваяСтрока.Close = МассивЗначений[4];  
				НоваяСтрока.Volume = МассивЗначений[6];	
			Иначе
				НоваяСтрока.Период = Дата(ПеревернутьДату(МассивЗначений[0]) +" "+ МассивЗначений[1]);
				НоваяСтрока.Open = МассивЗначений[2]; 
				НоваяСтрока.High = МассивЗначений[3];
				НоваяСтрока.Low = МассивЗначений[4];  
				НоваяСтрока.Close = МассивЗначений[5];  
				НоваяСтрока.Volume = МассивЗначений[7];		
			КонецЕсли;
			
						
		Строка = Чтение.ПрочитатьСтроку();	
			
		КонецЦикла;
		
		Результат = Истина;
	Исключение
	КонецПопытки;
	Возврат Результат;
КонецФункции// ()

Функция ПеревернутьДату(Дата)
         	//дд
Возврат Сред(Дата,9,2)+"."+Сред(Дата,6,2)+"."+Лев(Дата,4);	

КонецФункции // ()


&НаСервере
Процедура ЗагрузитьВБазуНаСервере()
	
	Для каждого Строка Из Объект.Котировки Цикл
		
		НЗ = РегистрыСведений.Котировки.СоздатьНаборЗаписей(); 
		НЗ.Отбор.Период.Установить(Строка.Период);
		НЗ.Отбор.Таймфрейм.Установить(Строка.Таймфрейм);
		НЗ.Отбор.Инструмент.Установить(Строка.Инструмент);
		
		НЗ.Прочитать();		
		Если НЕ НЗ.Количество() Тогда
			
			НоваяЗаписьНЗ = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗаписьНЗ,Строка);	
			НЗ.Записать(Ложь);    
		Иначе 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Запись " + Строка(Строка) + "Уже присутствует!";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВБазу(Команда)  
	Если НЕ Объект.Котировки.Количество() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет строк для загрузки!";
		Сообщение.Поле = "Объект.Котировки";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат;	
		
		
	КонецЕсли;
	ЗагрузитьВБазуНаСервере();
КонецПроцедуры
