&НаКлиенте
Процедура ПараметрыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Параметры.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Параметры.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
КонецПроцедуры



&НаКлиенте
Процедура ПараметрыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.Параметры.ТекущиеДанные.Дата = ТекущаяДата();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьИзображение(Команда)
	_FinanceРаботаСИзображениямиКлиентСервер.ПриНажатииКнопкиПрикрепитьИзображениеНаКлиенте(Объект,ЭтаФорма);
	ПриСозданииНаСервере(Ложь,Ложь);
КонецПроцедуры


//Обработка действия нажатия на картинку 
// Прикрепляется в общем модуле _FinanceРаботаСИзображениямиСервер
//
&НаКлиенте
Процедура ОбработкаНажатияНаКартинку(Элемент, СтандартнаяОбработка)    

СтандартнаяОбработка = Ложь;

ОткрытьЗначение(ПолучитьИзВременногоХранилища(ЭтаФорма[Элемент.Имя]));
//ПоказатьЗначение(ПолучитьИзВременногоХранилища(ЭтаФорма[Элемент.Имя]));

КонецПроцедуры // ОбработкаНажатияНаКартинку()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		_FinanceРаботаСИзображениямиСервер.ПриСозданииНаСервере(Объект,ЭтаФорма);
КонецПроцедуры

