
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ДеньНедели)  Тогда
		Объект.ДеньНедели = Перечисления.ДниНедели.Получить(ДеньНедели(ТекущаяДата())-1);		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Текст = Новый ХранилищеЗначения(ФорматированныйДокумент);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ФорматированныйДокумент = ТекущийОбъект.Текст.Получить();
КонецПроцедуры
