
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьСлучайнуюЗаметку();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСлучайнуюЗаметку()

	СписокЗаметок  = ПолучитьСписокДокументовЗаметка();
	Генератор = Новый ГенераторСлучайныхЧисел(0);
	СлучайныйНомерДокумента = Генератор.СлучайноеЧисло(0,СписокЗаметок.Количество()-1);

	ЭтаФорма.Заголовок = СписокЗаметок[СлучайныйНомерДокумента].Заголовок;
	
	Заметка = СписокЗаметок[СлучайныйНомерДокумента].Хранилище.Получить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДокументовЗаметка()
	
	МассивДокументов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заметки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заметки КАК Заметки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДокументов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
Возврат МассивДокументов;

КонецФункции // ()
