
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОбзорПоИнструменту") Тогда
		// Заполнение шапки
		ИдеяАктивна = ДанныеЗаполнения.ИдеяАктивна;
		Инструмент = ДанныеЗаполнения.Инструмент;
		КоличествоПопытокВхода = ДанныеЗаполнения.КоличествоПопытокВхода;
		НаправлениеСделки = ДанныеЗаполнения.НаправлениеСделки;
		Объем = ДанныеЗаполнения.Объем;
		ОписаниеИдеи = ДанныеЗаполнения.ОписаниеИдеи;
		ОтменаИдеи = ДанныеЗаполнения.ОтменаИдеи;
		Потенциал = ДанныеЗаполнения.Потенциал;
		ЦеноваяМодель = ДанныеЗаполнения.ЦеноваяМодель;
		Для Каждого ТекСтрокаПараметрыСигнала Из ДанныеЗаполнения.ПараметрыСигнала Цикл
			НоваяСтрока = ПараметрыСигнала.Добавить();
			НоваяСтрока.Параметр = ТекСтрокаПараметрыСигнала.Параметр;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
