
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	_FinanceРаботаСИзображениямиСервер.ПриСозданииНаСервере(Объект,ЭтаФорма);    
	
		// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьИзображение(Команда)
	Если Объект.Ссылка.Пустая()  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Перед загрузкой изображения необходимо записать документ!";
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файла";
	//Диалог.Фильтр = "Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	Диалог.ИндексФильтра = 0;
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.МножественныйВыбор = Ложь; 
	//Диалог.ПолноеИмяФайла = ПутьКФайлу;
	
	Если Диалог.Выбрать() Тогда
		_FinanceРаботаСИзображениямиСервер.ЗаписатьИзображениеВБазу(Диалог.ПолноеИмяФайла,Объект.Ссылка);
		ОтобразитьИзображенияНаФорме(_FinanceРаботаСИзображениямиСервер.ПолучитьПрикрепленныеИзображения(Объект.Ссылка));	
	КонецЕсли;	

КонецПроцедуры
&НаСервере
Процедура ОтобразитьИзображенияНаФорме(Изображения)
	Для каждого Строка Из Изображения Цикл		
		ИмяРеквизита = "Картинка_" + Строка.Ключ ;
		Если НЕ РеквизитПисутствуетНаФорме(ИмяРеквизита) Тогда
			
			
			НовыйРевизит = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Строка"));
			ДобавляемыйРеквизит    = Новый Массив;
			ДобавляемыйРеквизит.Добавить(НовыйРевизит);    
			ИзменитьРеквизиты(ДобавляемыйРеквизит);
			
			КартинкаПортрета = Элементы.Добавить("Картинка_" + Строка.Ключ , Тип("ПолеФормы"), Элементы.ГруппаИзображений);
			КартинкаПортрета.Вид = ВидПоляФормы.ПолеКартинки;
			КартинкаПортрета.ПутьКДанным = НовыйРевизит.Имя;
			КартинкаПортрета.РазмерКартинки = РазмерКартинки.Пропорционально;
			КартинкаПортрета.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Низ;
			КартинкаПортрета.Заголовок = Строка.Ключ;
			ЭтаФорма[ИмяРеквизита] = ПоместитьВоВременноеХранилище(Новый Картинка(Строка.Значение));	
			
		КонецЕсли;		
		
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры // ()

&НаСервере
Функция  РеквизитПисутствуетНаФорме(ИмяРеквизита)
	Для каждого СтрокаРеквизитов Из ЭтаФорма.ПолучитьРеквизиты() Цикл		
		Если СтрокаРеквизитов.Имя = ИмяРеквизита Тогда
			Возврат Истина
		КонецЕсли
	КонецЦикла;
	Возврат Ложь;
КонецФункции // ()


//Обработка действия нажатия на картинку 
// Прикрепляется в общем модуле _FinanceРаботаСИзображениямиСервер
//
&НаКлиенте
Процедура ОбработкаНажатияНаКартинку(Элемент, СтандартнаяОбработка)    
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьЗначение(ПолучитьИзВременногоХранилища(ЭтаФорма[Элемент.Имя]));
	
КонецПроцедуры // ОбработкаНажатияНаКартинку()

