
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если ЗначениеЗаполнено(Объект.ДатаСтарта) И ЗначениеЗаполнено(Объект.ДатаФиниша) Тогда
		КоличествоНедель = ПолучитьКокличествоНедель();
		
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)  Тогда
		Возврат;	
	КонецЕсли;

	 ЭтапыСпринта = ПолучитьЭтапыСпринтаНаСервере(Объект.Ссылка);
	 
	 Если ЭтапыСпринта.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	НомерСпринта = 0;
	
	Для каждого Этап Из ЭтапыСпринта Цикл
		НомерСпринта = НомерСпринта +1;
		ДобаитьРеквизитФормы(Этап.Ссылка,НомерСпринта);	
	КонецЦикла;


	
КонецПроцедуры


&НаСервере
Процедура ДобаитьРеквизитФормы(СсылкаНаЭтап,НомерЭтапа)
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.Этапы");
	
	РеквизитФормы = Новый РеквизитФормы(
		"Этап_"+Строка(НомерЭтапа),  //Имя реквизита формы
		ТипРеквизита,     //Тип
		"",               //Путь  (Пусто, "Объект", ИмяТЧ)
						  // например "Объект.Товары"	
		Строка(НомерЭтапа)+". " + Строка(СсылкаНаЭтап.Цель));//Заголовок
						  							 
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	
	//Заставляем форму создать новые реквизиты
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//Обращение к реквизиту формы из кода
	ЭтаФорма["Этап_"+Строка(НомерЭтапа)] = СсылкаНаЭтап;
		
	//Вывод реквизита на форму (при необходимости)
	ПолеВвода = Элементы.Добавить("Этап_"+Строка(НомерЭтапа), Тип("ПолеФормы"), Элементы.ГруппаЭтаповСпринта);
	ПолеВвода.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеВвода.Гиперссылка = Истина;
	ПолеВвода.ПутьКДанным = "Этап_"+Строка(НомерЭтапа);

	
	

КонецПроцедуры // ()



&НаСервере
Функция ПолучитьЭтапыСпринтаНаСервере(Ссылка)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Этапы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Этапы КАК Этапы
		|ГДЕ
		|	Этапы.Спринт = &Спринт";
	
	Запрос.УстановитьПараметр("Спринт", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	

	

КонецФункции // ()


&НаСервере
Функция ПолучитьКокличествоНедель()
	Если Не  ЗначениеЗаполнено(Объект.ДатаФиниша) Тогда
		
		
		Возврат Неопределено;
		
	КонецЕсли;
	Если НЕ Объект.ДатаФиниша > Объект.ДатаСтарта  Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата финиша не может быть меньше даты старта!";
		Сообщение.Поле = "ДатаФиниша";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		Возврат Неопределено;				
	КонецЕсли;
	
	//При переходе через год необходимо изменить расчёт
	
	Если НеделяГода(Объект.ДатаСтарта) < НеделяГода(Объект.ДатаФиниша)  Тогда
	
		КоличествоНедель = НеделяГода(Объект.ДатаФиниша) - НеделяГода(Объект.ДатаСтарта) + 1;	
	Иначе
		
		//Нужно понять какой номер у последней недели, затем прибавить количество недель с начала года
		НомерПоследнейНеделиГода = ПолучитьПоследнююНеделюГода();
		 КоличествоНедель = НомерПоследнейНеделиГода - НеделяГода(Объект.ДатаСтарта) + НеделяГода(Объект.ДатаФиниша);
		
	КонецЕсли;
	
	
	Возврат КоличествоНедель;  
	
КонецФункции // ()

&НаКлиенте
Процедура ДатаСтартаПриИзменении(Элемент)
	КоличествоНедель = ПолучитьКокличествоНедель();
КонецПроцедуры

&НаКлиенте
Процедура ДатаФинишаПриИзменении(Элемент)
	КоличествоНедель = ПолучитьКокличествоНедель();
КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнююНеделюГода()

Возврат НеделяГода(Дата(Год(ТекущаяДата()),12,31));	

КонецФункции // ()
