

&НаКлиенте
Процедура ПрикрепитьИзображение(Команда)
	_FinanceРаботаСИзображениямиКлиентСервер.ПриНажатииКнопкиПрикрепитьИзображениеНаКлиенте(Объект,ЭтаФорма);
	ПриСозданииНаСервере(Ложь,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНажатияНаКартинку(Элемент, СтандартнаяОбработка)    

СтандартнаяОбработка = Ложь;

ОткрытьЗначение(ПолучитьИзВременногоХранилища(ЭтаФорма[Элемент.Имя]));

КонецПроцедуры // ОбработкаНажатияНаКартинку()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	_FinanceРаботаСИзображениямиСервер.ПриСозданииНаСервере(Объект,ЭтаФорма);
КонецПроцедуры

