
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланСделки") Тогда
		// Заполнение шапки
		Основание = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Основание.ИдеяАктивна Тогда
		ПланОбъект = Основание.ПолучитьОбъект();
		ПланОбъект.ИдеяАктивна = Ложь;
		ПланОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);	
	КонецЕсли;
КонецПроцедуры
