
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	 ТекущийОбъект.СуммаДокумента = 0;
	Для каждого Строка Из ТекущийОбъект.Товары Цикл
	     ТекущийОбъект.СуммаДокумента = ТекущийОбъект.СуммаДокумента + Строка.Сумма;			
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьОстаткиДенежныхСредств();
КонецПроцедуры

// Заполняет табличную часть остатков ДС
&НаСервере
Процедура ЗаполнитьОстаткиДенежныхСредств()
Остатки = ПолучитьОстаткиНаДатуДокумента(Объект.Дата);
ОстатокДенежныхСредств.Загрузить(Остатки);	
КонецПроцедуры // ()


// Получает остатки денежных средств на дату
&НаСервере
Функция ПолучитьОстаткиНаДатуДокумента(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиДенежныхСредствОстатки.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ОстаткиДенежныхСредствОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(&Дата, ) КАК ОстаткиДенежныхСредствОстатки";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();	

КонецФункции // ()


&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	//Строка = Элемент.ТекущиеДанные;
КонецПроцедуры

