

&НаКлиенте
Процедура ПараметрыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Параметры.ТекущиеДанные;
	СтоимостьШага =  ПолучитьСтоимостьШагаПоИнструменту(Объект.Инструмент);
	
	Если  СтоимостьШага = Неопределено Тогда		
		СтоимостьШага = 1;			
	КонецЕсли;
	
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество*СтоимостьШага;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Параметры.ТекущиеДанные;
	
	СтоимостьШага =  ПолучитьСтоимостьШагаПоИнструменту(Объект.Инструмент);
	
	Если  СтоимостьШага = Неопределено Тогда		
		СтоимостьШага = 1;			
	КонецЕсли;
	
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество*СтоимостьШага;
КонецПроцедуры


Функция ПолучитьСтоимостьШагаПоИнструменту(Инструмент)
	
	Возврат УправлениеСвойствами.ЗначениеСвойства(Инструмент,ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("STEPPRICE"));	
	
КонецФункции // ()


&НаКлиенте
Процедура ПараметрыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Элементы.Параметры.ТекущиеДанные.Дата = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьИзображение(Команда)
	_FinanceРаботаСИзображениямиКлиентСервер.ПриНажатииКнопкиПрикрепитьИзображениеНаКлиенте(Объект,ЭтаФорма);
	ОбновитьИзображенияНаСервере()
КонецПроцедуры


&НаСервере
Процедура ОбновитьИзображенияНаСервере()

	_FinanceРаботаСИзображениямиСервер.ПриСозданииНаСервере(Объект,ЭтаФорма);


КонецПроцедуры // ОбновитьИзображенияНаСервере()



&НаСервере
Функция  РеквизитПисутствуетНаФорме(ИмяРеквизита)
	Для каждого СтрокаРеквизитов Из ЭтаФорма.ПолучитьРеквизиты() Цикл		
		Если СтрокаРеквизитов.Имя = ИмяРеквизита Тогда
			Возврат Истина
		КонецЕсли
	КонецЦикла;
	Возврат Ложь;
КонецФункции // ()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	
	  _FinanceРаботаСИзображениямиСервер.ПриСозданииНаСервере(Объект,ЭтаФорма);
	
КонецПроцедуры



&НаСервере
Процедура ТипСделкиПриИзмененииНаСервере()
	Если Объект.ТипСделки = Перечисления.ТипСделки.Вход ИЛИ Объект.ТипСделки = Перечисления.ТипСделки.Докупка Тогда
		Элементы.ФормаСоздатьЗакрытиеПозиции.Видимость = Истина;
	Иначе 	
		Элементы.ФормаСоздатьЗакрытиеПозиции.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСделкиПриИзменении(Элемент)
	ТипСделкиПриИзмененииНаСервере();
КонецПроцедуры

//Обработка действия нажатия на картинку 
// Прикрепляется в общем модуле _FinanceРаботаСИзображениямиСервер
//
&НаКлиенте
Процедура ОбработкаНажатияНаКартинку(Элемент, СтандартнаяОбработка)    

СтандартнаяОбработка = Ложь;

ОткрытьЗначение(ПолучитьИзВременногоХранилища(ЭтаФорма[Элемент.Имя]));

КонецПроцедуры // ОбработкаНажатияНаКартинку()


/// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.Параметры.ТекущиеДанные.Дата = ТекущаяДата();		
	КонецЕсли;	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства


