
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	 ТекущийОбъект.СуммаДокумента = 0;
	Для каждого Строка Из ТекущийОбъект.ПланРасходов Цикл
	     ТекущийОбъект.СуммаДокумента = ТекущийОбъект.СуммаДокумента + Строка.Сумма;			
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Месяц)  Тогда
		Объект.Месяц = Перечисления.МесяцПрописью.Получить(Месяц(ТекущаяДата()));	
	КонецЕсли;
КонецПроцедуры
