&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = "";
	Фильтр = "XML (*.xml) | *.xml";
	Диалог.Фильтр = Фильтр;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = "C:\";
	Если Диалог.Выбрать() Тогда
		Объект.ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	Если ПустаяСтрока(Объект.ПутьКФайлу) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран файл для загрузки!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	РезультатЗагрузки = ПрочитатьНаСервере(Объект.ПутьКФайлу);	
КонецПроцедуры
&НаСервере
Функция  ПрочитатьНаСервере(ПутьКФайлу)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатЗагрузки = ДокументОбъект.ПрочитатьДанныеXML_Открытие(Объект.ПутьКФайлу);
	
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	
	Если НЕ РезультатЗагрузки.Результат Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = РезультатЗагрузки.СообщениеОбОшибке;
		Сообщение.Сообщить();	
	КонецЕсли;
		
КонецФункции

&НаСервере
Функция  ЗагрузитьСделкиНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	Возврат ОбработкаОбъект.СоздатьДокументыСделок();
КонецФункции

&НаКлиенте
Процедура ЗагрузитьСделки(Команда)
	РезультатМетода = ЗагрузитьСделкиНаСервере();
	
	Если Не РезультатМетода.Результат Тогда		
		ПоказатьОповещениеПользователя(РезультатМетода.СообщениеОбОшибке);
	Иначе 
		ПоказатьОповещениеПользователя("Сделки загружены!");
	КонецЕсли;
	
КонецПроцедуры
