
// См. УправлениеСвойствамиПереопределяемый.ЗаполнитьНаборыСвойствОбъекта.
//
// Параметры:
//  Объект - см. УправлениеСвойствамиПереопределяемый.ЗаполнитьНаборыСвойствОбъекта.Объект
//  ТипСсылки - см. УправлениеСвойствамиПереопределяемый.ЗаполнитьНаборыСвойствОбъекта.ТипСсылки
//  НаборыСвойств - см. УправлениеСвойствамиПереопределяемый.ЗаполнитьНаборыСвойствОбъекта.НаборыСвойств
//  СтандартнаяОбработка - см. УправлениеСвойствамиПереопределяемый.ЗаполнитьНаборыСвойствОбъекта.СтандартнаяОбработка
//  КлючНазначения - см. УправлениеСвойствамиПереопределяемый.ЗаполнитьНаборыСвойствОбъекта.КлючНазначения
// 
Процедура ЗаполнитьНаборыСвойствОбъекта(Объект, ТипСсылки, НаборыСвойств, СтандартнаяОбработка, КлючНазначения) Экспорт
	
	Если ТипСсылки = Тип("СправочникСсылка.Инструменты") Тогда
		ЗаполнитьНаборыСвойствИнструментов(Объект, ТипСсылки, НаборыСвойств);		
	КонецЕсли;
	
КонецПроцедуры


// Получает наборы свойств партнера по установленным флагам.
// 
Процедура ЗаполнитьНаборыСвойствИнструментов(Объект, ТипСсылки, НаборыСвойств)
	//DAV
	Если НЕ Объект.Ссылка.Пустая()  Тогда
		
		Если Объект.Ссылка.ПринадлежитЭлементу(Справочники.Инструменты.Вклады) Тогда
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Инструменты_БанковскийВклад");
			Строка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			Строка.ТолькоПросмотр = Ложь;
			Строка.Заголовок = НСтр("ru = 'Параметры вклада'");
			Строка.ОтображатьЗаголовок = Истина;	
		ИначеЕсли Объект.Ссылка.ПринадлежитЭлементу(Справочники.Инструменты.Фьючерсы) Тогда 
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Инструменты_Фьючерсы");
			Строка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			Строка.ТолькоПросмотр = Истина;
			Строка.Заголовок = НСтр("ru = 'Параметры Фьючерса'");
			Строка.ОтображатьЗаголовок = Истина;	
			
		ИначеЕсли Объект.Ссылка.ПринадлежитЭлементу(Справочники.Инструменты.Акции) Тогда 
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Инструменты_Акции");
			Строка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			Строка.ТолькоПросмотр = Истина;
			Строка.Заголовок = НСтр("ru = 'Параметры акции'");
			Строка.ОтображатьЗаголовок = Истина;	
			
		ИначеЕсли Объект.Ссылка.ПринадлежитЭлементу(Справочники.Инструменты.Облигации) Тогда 
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Инструменты_Облигации");
			Строка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			Строка.ТолькоПросмотр = Истина;
			Строка.Заголовок = НСтр("ru = 'Параметры облигации'");
			Строка.ОтображатьЗаголовок = Истина;				
		КонецЕсли;
		
		//Свойства группы удаленных реквизитов.
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка();
		Строка.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
		Строка.ОтображатьЗаголовок = Истина;
		Строка.Заголовок = НСтр("ru = 'Более не используемые реквизиты'");
		
	Иначе
		//Создаётся новый элемент
		
		Если Объект.Родитель.ПринадлежитЭлементу(Справочники.Инструменты.Вклады) ИЛИ Объект.Родитель = Справочники.Инструменты.Вклады Тогда
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Инструменты_БанковскийВклад");
			Строка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			Строка.ТолькоПросмотр = Ложь;
			Строка.Заголовок = НСтр("ru = 'Параметры вклада'");
			Строка.ОтображатьЗаголовок = Истина;	
		ИначеЕсли Объект.Родитель.ПринадлежитЭлементу(Справочники.Инструменты.Фьючерсы) ИЛИ Объект.Родитель = Справочники.Инструменты.Фьючерсы Тогда 
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Инструменты_Фьючерсы");
			Строка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			Строка.ТолькоПросмотр = Ложь;
			Строка.Заголовок = НСтр("ru = 'Параметры фьючерса'");
			Строка.ОтображатьЗаголовок = Истина;	
			
		ИначеЕсли Объект.Родитель.ПринадлежитЭлементу(Справочники.Инструменты.Акции) ИЛИ Объект.Родитель = Справочники.Инструменты.Акции Тогда 
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Инструменты_Акции");
			Строка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			Строка.ТолькоПросмотр = Ложь;
			Строка.Заголовок = НСтр("ru = 'Параметры акции'");
			Строка.ОтображатьЗаголовок = Истина;	
			
		ИначеЕсли Объект.Родитель.ПринадлежитЭлементу(Справочники.Инструменты.Облигации) ИЛИ Объект.Родитель = Справочники.Инструменты.Облигации Тогда 
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Инструменты_Облигации");
			Строка.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			Строка.ТолькоПросмотр = Ложь;
			Строка.Заголовок = НСтр("ru = 'Параметры облигации'");
			Строка.ОтображатьЗаголовок = Истина;				
		КонецЕсли;
		
		//Свойства группы удаленных реквизитов.
		Строка = НаборыСвойств.Добавить();
		Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка();
		Строка.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
		Строка.ОтображатьЗаголовок = Истина;
		Строка.Заголовок = НСтр("ru = 'Более не используемые реквизиты'");

		
		
	КонецЕсли;
	
	//DAV
	
	
	//
	//Если ТипЗнч(Объект) = ТипСсылки Тогда
	//	Партнер = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
	//		Объект, "Клиент, Конкурент, Поставщик, ПрочиеОтношения, ЭтоГруппа");
	//Иначе
	//	Партнер = Объект;
	//КонецЕсли;
	//
	//Если Партнер.ЭтоГруппа = Ложь Тогда
	//	
	//	Строка = НаборыСвойств.Добавить();
	//	Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Общие");
	//	Строка.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	//	Строка.ОтображатьЗаголовок = Истина;
	//	Строка.ОбщийНабор = Истина;
	//	Строка.Заголовок  = НСтр("ru = 'Для всех партнеров'");
	//	
	//	Если Партнер.Клиент Тогда
	//		Строка = НаборыСвойств.Добавить();
	//		Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Клиенты");
	//		Строка.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	//		Строка.Заголовок = НСтр("ru = 'Для клиентов'");
	//		Строка.ОтображатьЗаголовок = Истина;
	//	КонецЕсли;
	//	
	//	Если Партнер.Конкурент Тогда
	//		Строка = НаборыСвойств.Добавить();
	//		Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Конкуренты");
	//		Строка.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	//		Строка.ОтображатьЗаголовок = Истина;
	//		Строка.Заголовок = НСтр("ru = 'Для конкурентов'");
	//	КонецЕсли;
	//	
	//	Если Партнер.Поставщик Тогда
	//		Строка = НаборыСвойств.Добавить();
	//		Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Поставщики");
	//		Строка.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	//		Строка.ОтображатьЗаголовок = Истина;
	//		Строка.Заголовок = НСтр("ru = 'Для поставщиков'");
	//	КонецЕсли;
	//	
	//	Если Партнер.ПрочиеОтношения Тогда
	//		Строка = НаборыСвойств.Добавить();
	//		Строка.Набор = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Партнеры_Прочие");
	//		Строка.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	//		Строка.ОтображатьЗаголовок = Истина;
	//		Строка.Заголовок = НСтр("ru = 'Для прочих'");
	//	КонецЕсли;
	//	
	//	// Свойства группы удаленных реквизитов.
	//	Строка = НаборыСвойств.Добавить();
	//	Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка();
	//	Строка.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	//	Строка.ОтображатьЗаголовок = Истина;
	//	Строка.Заголовок = НСтр("ru = 'Более не используемые реквизиты'");
	//КонецЕсли;
	
КонецПроцедуры

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
// 
// Параметры:
//  Наборы - см. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.Наборы
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	//DAV
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_Инструменты";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоРеквизиту("ИмяПредопределенногоНабора","Справочник_Инструменты").УникальныйИдентификатор();
	
	ДочернийНабор = Набор.Строки.Добавить();
	ДочернийНабор.Имя = "Справочник_Инструменты_Фьючерсы";
	ДочернийНабор.Идентификатор =Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоРеквизиту("ИмяПредопределенногоНабора","Справочник_Инструменты_Фьючерсы").УникальныйИдентификатор();

	
	ДочернийНабор = Набор.Строки.Добавить();
	ДочернийНабор.Имя = "Справочник_Инструменты_Акции";
	ДочернийНабор.Идентификатор = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоРеквизиту("ИмяПредопределенногоНабора","Справочник_Инструменты_Акции").УникальныйИдентификатор();
	
	ДочернийНабор = Набор.Строки.Добавить();
	ДочернийНабор.Имя = "Справочник_Инструменты_Облигации";
	ДочернийНабор.Идентификатор = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоРеквизиту("ИмяПредопределенногоНабора","Справочник_Инструменты_Облигации").УникальныйИдентификатор();

	
	ДочернийНабор = Набор.Строки.Добавить();
	ДочернийНабор.Имя = "Справочник_Инструменты_БанковскийВклад";
	ДочернийНабор.Идентификатор = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоРеквизиту("ИмяПредопределенногоНабора","Справочник_Инструменты_БанковскийВклад").УникальныйИдентификатор();

	
	//DAV
	
КонецПроцедуры

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииНаименованийНаборовСвойств.
//
Процедура ПриПолученииНаименованийНаборовСвойств(Наименования, КодЯзыка) Экспорт
//DAV
	Наименования["Справочник_Инструменты_Фьючерсы"] = НСтр("ru = 'Фьючерсы';
																|en = 'Futures'", КодЯзыка);
	Наименования["Справочник_Инструменты_Акции"]   = НСтр("ru = 'Акции';
																|en = 'Shares'", КодЯзыка);
	Наименования["Справочник_Инструменты_Облигации"]   = НСтр("ru = 'Облигации';
																|en = 'Bonds'", КодЯзыка);

//DAV	
КонецПроцедуры


