
&НаКлиенте
Процедура ПриНажатииКнопкиПрикрепитьИзображениеНаКлиенте(Объект,Форма)Экспорт 
	Если Объект.Ссылка.Пустая()  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Перед загрузкой изображения необходимо записать документ!";
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файла";
	//Диалог.Фильтр = "Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	Диалог.ИндексФильтра = 0;
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.МножественныйВыбор = Ложь; 
	//Диалог.ПолноеИмяФайла = ПутьКФайлу;
	
	Если Диалог.Выбрать() Тогда
		_FinanceРаботаСИзображениямиСервер.ЗаписатьИзображениеВБазу(Диалог.ПолноеИмяФайла,Объект.Ссылка);
//		_FinanceРаботаСИзображениямиСервер.ОтобразитьИзображенияНаФорме(_FinanceРаботаСИзображениямиСервер.ПолучитьПрикрепленныеИзображения(Объект.Ссылка),Форма);	
	КонецЕсли;	
		 
КонецПроцедуры // ()



