
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Каталог = Объект.Файл;
	ДиалогВыбораФайла.Заголовок = "Выберите каталог";
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ФайлНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)));
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	
	
	Если НЕ (ВыбранныеФайлы <> Неопределено) Тогда
		Возврат;
	КонецЕсли;    
	
	Объект.Файл = ДиалогВыбораФайла.ПолноеИмяФайла;
	Элементы.Прочитать.Доступность = Истина;
	
КонецПроцедуры


&НаСервере
Функция  ПрочитатьНаСервере()	
	Объект.Сделки.Очистить();
	
	Чтение = Новый ЧтениеТекста();                                   
	Попытка
		
		Чтение.Открыть(Объект.Файл,КодировкаТекста.UTF8);
		
		Строка = Чтение.ПрочитатьСтроку();
		НаправлениеСделки = Неопределено;
		Пока Не Строка = Неопределено Цикл
			
			МассивЗначений = СтрРазделить(Строка,";",Ложь);
			
			НоваяСтрока = Объект.Сделки.Добавить();
			
			НоваяСтрока.Период =  Дата(ПеревернутьДату(МассивЗначений[0]));
			НоваяСтрока.Инструмент = Справочники.Инструменты.НайтиПоНаименованию(СтрЗаменить(МассивЗначений[1]," ",""));
			Если МассивЗначений[2] <> "Close"  Тогда				
				НаправлениеСделки = МассивЗначений[2];				
				НоваяСтрока.ТипСделки =  Перечисления.ТипСделки.Вход;
			Иначе
				НоваяСтрока.ТипСделки =  Перечисления.ТипСделки.Выход;	
			КонецЕсли;			
			НоваяСтрока.Направление = ?(НаправлениеСделки = "Sell",Перечисления.НаправлениеСделки.Продажа,Перечисления.НаправлениеСделки.Покупка);
			НоваяСтрока.ЦенаОткрытия = МассивЗначений[3];
			НоваяСтрока.ЦенаСтоп	= МассивЗначений[4];
			
			Строка = Чтение.ПрочитатьСтроку();
			
		КонецЦикла; 
		
	Исключение
		
	КонецПопытки;
	
	
	
	
	
	Возврат Истина;
	
КонецФункции


&НаКлиенте
Процедура Прочитать(Команда)
	Если ПустаяСтрока(Объект.Файл) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не задано имя файла!";
		Сообщение.Поле = "Объект.Файл";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;
	
	ПрочитатьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Прочитать.Доступность = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ФайлПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.Файл) Тогда
		Элементы.Прочитать.Доступность = Ложь;	
	КонецЕсли;
КонецПроцедуры


Функция ПеревернутьДату(Дата)
         	//дд
Возврат Сред(Дата,9,2)+"."+Сред(Дата,6,2)+"."+Лев(Дата,4)+" "+Прав(Дата,8);	

КонецФункции // ()
