
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка)  Тогда
		Возврат;	
	КонецЕсли;
	
	КлючевыеЗадачи = ПолучитьКлючевыеЗадачиНаСервере(Объект.Ссылка);
	
	Если КлючевыеЗадачи.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	НомерКлючеойЗадачи = 0;
	Для каждого Задача Из КлючевыеЗадачи Цикл
		НомерКлючеойЗадачи = НомерКлючеойЗадачи + 1;
		ДобаитьРеквизитФормы(Задача.Ссылка,НомерКлючеойЗадачи);
	
	КонецЦикла;
	
	
КонецПроцедуры



&НаСервере
Функция ПолучитьКлючевыеЗадачиНаСервере(Ссылка)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючевыеЗадачи.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КлючевыеЗадачи КАК КлючевыеЗадачи
		|ГДЕ
		|	КлючевыеЗадачи.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	

	

КонецФункции // ()

&НаСервере
Процедура ДобаитьРеквизитФормы(СсылкаНаЭтап,НомерКлючевойЗадачи)
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ТипРеквизита = Новый ОписаниеТипов("ДокументСсылка.КлючевыеЗадачи");
	
	РеквизитФормы = Новый РеквизитФормы(
		"КлючеваяЗадача_"+Строка(НомерКлючевойЗадачи),  //Имя реквизита формы
		ТипРеквизита,     //Тип
		"",               //Путь  (Пусто, "Объект", ИмяТЧ)
						  // например "Объект.Товары"	
		Строка(НомерКлючевойЗадачи)+". " + Строка(СсылкаНаЭтап.Название));//Заголовок
						  							 
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	
	//Заставляем форму создать новые реквизиты
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//Обращение к реквизиту формы из кода
	ЭтаФорма["КлючеваяЗадача_"+Строка(НомерКлючевойЗадачи)] = СсылкаНаЭтап;
		
	//Вывод реквизита на форму (при необходимости)
	ПолеВвода = Элементы.Добавить("КлючеваяЗадача_"+Строка(НомерКлючевойЗадачи), Тип("ПолеФормы"), Элементы.ГруппаКлючевыхЗадач);
	ПолеВвода.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеВвода.Гиперссылка = Истина;
	ПолеВвода.ПутьКДанным = "КлючеваяЗадача_"+Строка(НомерКлючевойЗадачи);

	
	

КонецПроцедуры // ()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не Объект.ПоказателиУспеха.Количество() Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не задано ни одного показателя успешного выполнения этапа!";
		Сообщение.Поле = "ПоказателиУспеха";
		Сообщение.УстановитьДанные(ТекущийОбъект);
		Сообщение.Сообщить();	
	    Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
