
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ОтобразитьКартинкуДляЭлемента();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьКартинкуДляЭлемента()
	
	Если ТипЗнч(ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Картинка = Неопределено;
		Возврат;		
	КонецЕсли;
	Изображение = Неопределено;
	Ссылка= ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока.Ссылка; 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранимыеИзображения.Изображение КАК Изображение
	|ИЗ
	|	РегистрСведений.ХранимыеИзображения КАК ХранимыеИзображения
	|ГДЕ
	|	ХранимыеИзображения.ОбъектПривязки = &Ссылка
	|	И ХранимыеИзображения.Номер = 1";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Изображение = ПоместитьВоВременноеХранилище(ВыборкаДетальныеЗаписи.Изображение.Получить());		
	КонецЦикла;
	
	Если НЕ Изображение = Неопределено  Тогда
		Картинка = Изображение;
	Иначе 
		Картинка = Неопределено;		   	   
	КонецЕсли;
	
	
	
КонецПроцедуры // ПолучитьКартинкуДляЭлемента()

