
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Каталог = Объект.Файл;
	ДиалогВыбораФайла.Заголовок = "Выберите каталог";
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ФайлНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)));
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	
	
	Если НЕ (ВыбранныеФайлы <> Неопределено) Тогда
		Возврат;
	КонецЕсли;    
	
	Объект.Файл = ДиалогВыбораФайла.ПолноеИмяФайла;
	Элементы.Прочитать.Доступность = Истина;
	
КонецПроцедуры


&НаСервере
Функция  ПрочитатьНаСервере()	
	Объект.Сделки.Очистить();
	
	Чтение = Новый ЧтениеТекста();                                   
	Попытка
		
		Чтение.Открыть(Объект.Файл,КодировкаТекста.UTF8);
		
		Строка = Чтение.ПрочитатьСтроку();    
		Строка = Чтение.ПрочитатьСтроку();

		НаправлениеСделки = Неопределено;
		Пока Не Строка = Неопределено Цикл    
				
			МассивЗначений = СтрРазделить(Строка,",",Ложь); 
			
			Если МассивЗначений[1] = "-"  Тогда	// тут возможны два варианта либо  balance либо correction, пока пропускаем
				Строка = Чтение.ПрочитатьСтроку();
				Продолжить;
			КонецЕсли;
	
			
			НоваяСтрока = Объект.Сделки.Добавить();
			
			НоваяСтрока.Период =  Дата(ПеревернутьДату(МассивЗначений[0]));
			НоваяСтрока.Инструмент = Справочники.Инструменты.НайтиПоНаименованию(СтрЗаменить(МассивЗначений[1]," ",""));
			Если МассивЗначений[3] = "in"  Тогда				
				НаправлениеСделки = МассивЗначений[2];				
				НоваяСтрока.ТипСделки =  Перечисления.ТипСделки.Вход;
			Иначе
				НоваяСтрока.ТипСделки =  Перечисления.ТипСделки.Выход;	
			КонецЕсли;			
			НоваяСтрока.Направление = ?(НаправлениеСделки = "sell",Перечисления.НаправлениеСделки.Продажа,Перечисления.НаправлениеСделки.Покупка);
			НоваяСтрока.Цена = МассивЗначений[5];
			НоваяСтрока.ЦенаСтоп	= МассивЗначений[7];
			НоваяСтрока.ЦенаТейк	= МассивЗначений[8]; 
			НоваяСтрока.Объем	= МассивЗначений[4];
			Попытка
			
			НоваяСтрока.Идентификатор	= Число(МассивЗначений[12]);
	
			
			Исключение
			
			КонецПопытки;
            

			Строка = Чтение.ПрочитатьСтроку();
			
		КонецЦикла; 
		
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл!" + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	
	
	
	
	Возврат Истина;
	
КонецФункции


&НаКлиенте
Процедура Прочитать(Команда)
	Если ПустаяСтрока(Объект.Файл) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не задано имя файла!";
		Сообщение.Поле = "Объект.Файл";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат;	
	КонецЕсли;
	
	ПрочитатьНаСервере(); 
	
	Если Объект.Сделки.Количество() Тогда
		Элементы.СоздатьДокументыСделок.Доступность = Истина;
	Иначе 
		Элементы.СоздатьДокументыСделок.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Прочитать.Доступность = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ФайлПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.Файл) Тогда
		Элементы.Прочитать.Доступность = Ложь;	
	КонецЕсли;
КонецПроцедуры


Функция ПеревернутьДату(Дата)
         	//дд
Возврат Сред(Дата,9,2)+"."+Сред(Дата,6,2)+"."+Лев(Дата,4)+" "+Прав(Дата,8);	

КонецФункции // ()

&НаКлиенте
Процедура СоздатьДокументыСделок(Команда)
	СоздатьДокументыСделокНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыСделокНаСервере()
	ДокументыСделок = ПолучитьДанныеСделокДляСерии(Объект.СерияТестирования);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСделокДляСерии(СерияТестирования)

	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкаПараметры.Ссылка КАК Ссылка,
		|	СделкаПараметры.Дата КАК Дата,
		|	СделкаПараметры.Количество КАК Количество,
		|	СделкаПараметры.Цена КАК Цена,
		|	СделкаПараметры.Сумма КАК Сумма,
		|	СделкаПараметры.КомиссияБрокера КАК КомиссияБрокера,
		|	СделкаПараметры.КомиссияБиржи КАК КомиссияБиржи,
		|	СделкаПараметры.ЦенаСтопПриказа КАК ЦенаСтопПриказа,
		|	СделкаПараметры.НомерСделки КАК НомерСделки
		|ИЗ
		|	Документ.Сделка.Параметры КАК СделкаПараметры
		|ГДЕ
		|	СделкаПараметры.Ссылка.СерияТестирования = &СерияТестирования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗакрытиеСделкиПараметры.Ссылка,
		|	ЗакрытиеСделкиПараметры.Дата,
		|	ЗакрытиеСделкиПараметры.Количество,
		|	ЗакрытиеСделкиПараметры.Цена,
		|	ЗакрытиеСделкиПараметры.Сумма,
		|	ЗакрытиеСделкиПараметры.КомиссияБрокера,
		|	ЗакрытиеСделкиПараметры.КомиссияБиржи,
		|	ЗакрытиеСделкиПараметры.ЦенаСтопПриказа,
		|	ЗакрытиеСделкиПараметры.НомерСделки
		|ИЗ
		|	Документ.ЗакрытиеСделки.Параметры КАК ЗакрытиеСделкиПараметры
		|ГДЕ
		|	ЗакрытиеСделкиПараметры.Ссылка.СерияТестирования = &СерияТестирования";
	
	Запрос.УстановитьПараметр("СерияТестирования", СерияТестирования);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	

КонецФункции // ()

