

&НаСервере
Процедура ПолучитьИнструментыНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПолучитьДанныеОбИнструментах_MOEX(); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");   
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Обработка загрузки данных завершена!"; 
	Сообщение.Сообщить();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИнструменты(Команда)
	ПолучитьИнструментыНаСервере();
КонецПроцедуры

&НаСервере
Функция  ОбновитьИнструментыНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	Возврат ОбработкаОбъект.ОбновитьСправочникИнструментов();
КонецФункции // ()


&НаКлиенте
Процедура ОбновитьИнструменты(Команда)
	РезультатМетода = ОбновитьИнструментыНаСервере();
	Если Не РезультатМетода.Результат Тогда		
		ПоказатьОповещениеПользователя(РезультатМетода.СообщениеОбОшибке);
	Иначе 
		ПоказатьОповещениеПользователя("Справочник ""Инструменты"" обновлен успешно");
	КонецЕсли;
КонецПроцедуры
