
&НаСервере
Процедура СформироватьНаСервере()
	График = СформироватьHTML();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция СформироватьHTML()
	
	Данные = ПолучитьДанные();
	
	css = ПолучитьОбщийМакет("css").ПолучитьТекст(); 
	button = ПолучитьОбщийМакет("button").ПолучитьТекст();
	core4 = ПолучитьОбщийМакет("core4").ПолучитьТекст();
	charts4 = ПолучитьОбщийМакет("charts4").ПолучитьТекст();
	animated4 = ПолучитьОбщийМакет("animated4").ПолучитьТекст();
	app1 = ПолучитьОбщийМакет("app1").ПолучитьТекст();  
	app1_ = ПолучитьОбщийМакет("app1_").ПолучитьТекст();
	
	app2 = ПолучитьОбщийМакет("app2").ПолучитьТекст(); 
	app3 = ПолучитьОбщийМакет("app3").ПолучитьТекст();
	
	Если Параметры.Таймфрейм = Перечисления.Таймфреймы.День1 ИЛИ Параметры.Таймфрейм = Перечисления.Таймфреймы.Месяц1 ИЛИ Параметры.Таймфрейм = Перечисления.Таймфреймы.Неделя1 Тогда
		Период1 = "chart.dateFormatter.inputDateFormat = ""yyyy-MM-dd"";";
	Иначе		Период1 = "chart.dateFormatter.inputDateFormat = ""yyyy-MM-dd hh-mm-ss"";";	
		app3 = СтрЗаменить(app3,"day1","hour1");
	КонецЕсли;
	
	
	
	HTMLТекст = "<!DOCTYPE html>
	|<html>
	|<head>
	|<style>
	|"+css+"
	|</style>
	|</head>
	|<body>
	|"+button+"
	|<script>"+core4+"</script>
	|<script>"+charts4+"</script>
	|<script>"+animated4+"</script>
	|<script>
	|	
	|"+app1+"
//	|"+Период1+"
	|"+app1_+"
	|chart.data = "+Данные+";
	|"+app2+"
	|
//	|lineSeries2.data = "+Данные2+";
	|"+app3+"
	|
	|</script>
	|</body>
	|</html>";
	
   Возврат HTMLТекст;
КонецФункции // СформироватьHTML()

Функция ПолучитьДанные()
	
	Если Параметры.Таймфрейм = Перечисления.Таймфреймы.День1 ИЛИ Параметры.Таймфрейм = Перечисления.Таймфреймы.Месяц1 ИЛИ Параметры.Таймфрейм = Перечисления.Таймфреймы.Неделя1 Тогда
		Таблица = "ДневныеКотировки";
		Шаблон = "ДФ=yyyy-MM-dd";
	Иначе
		Таблица = "ЧасовыеКотировки";
		Шаблон = "ДФ='yyyy-MM-dd HH-mm-ss'";	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
		|	Котировки.Период КАК Период,
		|	Котировки.Инструмент КАК Инструмент,
		|	Котировки.Таймфрейм КАК Таймфрейм,
		|	Котировки.Open КАК Open,
		|	Котировки.Close КАК Close,
		|	Котировки.High КАК High,
		|	Котировки.Low КАК Low,
		|	Котировки.Volume КАК Volume
		|ИЗ
		|	РегистрСведений.Котировки КАК Котировки
		|ГДЕ
		|	Котировки.Период МЕЖДУ &Начало И &Конец
		|	И Котировки.Инструмент = &Инструмент
		|	И Котировки.Таймфрейм = &Таймфрейм";
	
	Запрос.УстановитьПараметр("Инструмент", Параметры.Инструмент);
	Запрос.УстановитьПараметр("Конец", Параметры.ПериодКонец);
	Запрос.УстановитьПараметр("Начало", Параметры.ПериодНачало);
	Запрос.УстановитьПараметр("Таймфрейм", Параметры.Таймфрейм);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Массив1 = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стрктура1 = Новый Структура("date,open,high,low,close,volume");
		Стрктура1.date = Формат(ВыборкаДетальныеЗаписи.Период,Шаблон);
		Стрктура1.open = СтрЗаменить(ВыборкаДетальныеЗаписи.open,",",".");
		Стрктура1.high = СтрЗаменить(ВыборкаДетальныеЗаписи.high,",",".");
		Стрктура1.low = СтрЗаменить(ВыборкаДетальныеЗаписи.low,",",".");
		Стрктура1.close = СтрЗаменить(ВыборкаДетальныеЗаписи.close,",",".");
		Стрктура1.volume = СтрЗаменить(ВыборкаДетальныеЗаписи.volume,",",".");
		Массив1.Добавить(Стрктура1);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Массив1);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	Возврат СтрокаJSON;
	

КонецФункции // ПолучитьДанные()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьНаСервере();
КонецПроцедуры
